### _Hello, this Notebook will give you a quick intro into how to append lists to a pandas dataframe_

In [1]:
import pandas as pd

### _First, let's create some data_

In [2]:
d={
    'Name':['Alice', 'Bob', 'Carl', 'Daisy', 'Elon'],
    'Age':[22, 35, 44, 63, 80],
    'Location':['Seattle', 'Lima', 'Osaka', 'Cairo', 'Berlin'],
    'Language':['JavaScript', 'Python', 'C#', 'Go', 'Fortran'],
}
# Create a DataFrame, df, from the data
df= pd.DataFrame(data=d)

### _Let's see what we're working with here_

In [3]:
df

    Name  Age Location    Language
0  Alice   22  Seattle  JavaScript
1    Bob   35     Lima      Python
2   Carl   44    Osaka          C#
3  Daisy   63    Cairo          Go
4   Elon   80   Berlin     Fortran

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
Name        5 non-null object
Age         5 non-null int64
Location    5 non-null object
Language    5 non-null object
dtypes: int64(1), object(3)
memory usage: 140.0+ bytes

### _Ok, now let's create our new rows/columns that we'll want to append to the dataset. We will try out different data types, and see what works and what doesn't_

In [7]:
num_list_4=[5, 6, 8, 9]
num_list_7=[64, 42, 101, 229, 1, 27, 35]
str_list_4=['green', 'yellow', 'blue', 'red']
str_list_7=['chartreuse', 'plum', 'amber', 'teal', 'salmon', 'limegreen', 'burgundy']

### _Here's a simple, overlooked solution, without resorting to df.append()_

In [6]:
df.loc[len(df)]=num_list_4
df.loc[len(df)]=str_list_4
df

    Name     Age Location    Language
0  Alice      22  Seattle  JavaScript
1    Bob      35     Lima      Python
2   Carl      44    Osaka          C#
3  Daisy      63    Cairo          Go
4   Elon      80   Berlin     Fortran
5      5       6        8           9
6  green  yellow     blue         red

### _Notice, in this case we_ have _to make sure that len(list)==len(df.columns)_

In [27]:
# Both these will return errors:
# df.loc[len(df)]=num_list_5
# df.loc[len(df)]=str_list_5

### _What if we want to do an analogous operation and a tack a column onto the end?_

In [26]:
# pd.concat([df, pd.Series(num_list_7, name="Hello")], axis=1)
df['Fav_Num']=num_list_7
df['Fav_Color']=str_list_7
df

    Name     Age Location    Language    Q  Fav_Num   Fav_Color
0  Alice      22  Seattle  JavaScript   64       64  chartreuse
1    Bob      35     Lima      Python   42       42        plum
2   Carl      44    Osaka          C#  101      101       amber
3  Daisy      63    Cairo          Go  229      229        teal
4   Elon      80   Berlin     Fortran    1        1      salmon
5      5       6        8           9   27       27   limegreen
6  green  yellow     blue         red   35       35    burgundy

### _Obviously, we have totally messed up the dtypes of our DataFrame_ ...  ¯\\_(ツ)_/¯

_The methods I've shown above work well enough, but they are crude and could result in problems if you have more complex data sets/structures to work with. For example, what if your un-appended data comes in a jumbled order? In this case (and most others), we will want to turn our list into either a Pandas DataFrame or Series. That way, we can make use of the powerful functions that include .append, .join, .concat, etc. and make sure our data is tacked on in the way that we want!_

In [34]:
# The columns for info we want are in totally different order than df
jumble_ser=pd.Series(['Toronto', 88, 'Perl', 'Omar', 'gold', 99, 0],
                     ['Location', 'Q', 'Language', 'Name', 'Fav_Color', 'Fav_Num', 'Age'])

In [44]:
#Not a problem if we use .append with a series!
df=df.append([jumble_ser], ignore_index=True)

### _And, of course, we can apply the SQL-like function, .join(), to do even more powerful merges of two data sets. In this case, all we know are the names of the person, and another piece of info_

In [48]:
food={
    'Alice': 'Curry',
    'Bob': 'Falafel',
    'Carl': 'Steak',
    'Daisy': 'Sushi',
    'Elon': 'Hot Dogs',
    'Omar': 'Red Bull Cans'
}
# we have to give food_ser a name field if we wish to join it to a dataframe
food_ser=pd.Series(food, name='Fav_food') 
df.join(food_ser, on='Name')

    Name     Age Location    Language    Q  Fav_Num   Fav_Color       Fav_food
0  Alice      22  Seattle  JavaScript   64       64  chartreuse          Curry
1    Bob      35     Lima      Python   42       42        plum        Falafel
2   Carl      44    Osaka          C#  101      101       amber          Steak
3  Daisy      63    Cairo          Go  229      229        teal          Sushi
4   Elon      80   Berlin     Fortran    1        1      salmon       Hot Dogs
5      5       6        8           9   27       27   limegreen            NaN
6  green  yellow     blue         red   35       35    burgundy            NaN
7   Omar       0  Toronto        Perl   88       99        gold  Red Bull Cans

### _That's all for now! Hopefully this will be enough to get the ball rolling. Experiment with the .append(), .join(), .concat(), and .merge() methods until you achieve your goal. There's plenty of ways to skin a cat!_